# a = int(input("Введите целое чило "))
# n = input("Как ваше имя ")

# ----------------------------------------------#
# ts = int(input("Введите время в секундах "))
# tm = int(ts / 60)
# if tm >= 59:
#     th = int(tm / 60)
#     tmin = int(tm - th * 60)
#     tsec = ts - (th * 60 * 60)
# else:
#     th = 0
#     tsec = ts - (tm * 60)
# if tm < 1:
#     tsec = ts
#     tmin = 0
#     th = 0
# format(th, '')
# print(f"Время в часах {th}:{tmin}:{tsec}")

# ---------------------------------------#

# a = int(input("Введите целое чило от 1 до 9"))
# a1 = a * 10 + a
# a2 = a * 100 + a1
# print(f"Результат {a + a1 +a2}")

# ---------------------------------------------#

# a = int(input("Введите целое положительное чило"))
# c = 0
# while a != 0:
#     b = a % 10
#     if b > c:
#         c = b
#     a = a // 10

# print(f"Самая большая цифра в этом числе {c}")
# -------------------5----------------------#

#-----------------Lesson2-------------------#
# -------------------1----------------------#
# list_1 = [1, 'a', [1, 3], 3.1, None]
# list_2 = []
# for i in list_1:
#     list_2.append(type(i))
#     print(type(i))
# print(list_2)

# -------------------2:2----------------------#

# -------------------2:3----------------------#

# q = {
#     1: "январь", 2: "февраль", 3: "март", 4: "апрель", 5: "май", 6: "июнь", 7: "июль", 8: "август", 9: "сентябрь", 10: "октябрь", 11: "ноябрь", 12: "декабрь"
# }
# corr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
# month = int(input("Ведите число от 1 до 12 "))

# print(f"Вы выбрали месяц {q[month]}") if month in corr else print(
#     f"Вы ввели некорректное значение")
# -------------------2:6----------------------#
# заполните информацио о товарах (запрос данных)
# создание цикла опроса с возрастающей нумерацией (до 4 например), задавать запросы
# в цикле заполнять словарь, сохранить все в заранее подготовленном списке и созранить в кортеж
qwes1 = int(
    input("Заполните информацию о товаре. Сколько товаров вы хотите внести? "))
dic = {"название": 1, "цена": 2, "количество": 3, "ед.": 4}
list_b = []
list_tuple = []
i = 0
while i < qwes1:
    list_b.clear()
    print(f"Товар {i + 1}")
    list_b.append(i + 1)
    qwes2 = input("Название товара ")
    qwes3 = input("Цена товара ")
    qwes4 = input("Количество товара ")
    qwes5 = input("Единицы измерения товара ")
    dic.update({"название": qwes2, "цена": qwes3,
                "количество": qwes4, "ед.": qwes5})
    list_b.append(dic.copy())
    list_tuple.append(tuple(list_b))
    print("Результат ", list_tuple[i])
    i += 1
print("Результат ")
for j in range(len(list_tuple)):
    print(list_tuple[j])
